#1.list
# n=[1,2,3,4,5,6,7,8,9,10]



#2.matrix
#m = [
#     [1, 2, 3],
#     [4, 5, 6]
#     ]
# print (m[1][2])
# #[1]ასახავს ჯგუფურ რაოდენობას
# #[2]ასახავს [1] ჯგუფში მე-2 ადგილას მდგომ რიცხვს.
# #მე-2 ადგილზე მდგომი რიცხვი არის 6, რადგან ათვლა 0=დან იწყება ანუ:
# #[4,5,6] 4-->ნ0;5-->ნ1;6-->ნ2



# my_str="Hello World!"
# print(my_str[6])
# #[6] აღნიშნავს მე-6 ადგილზე მდგომ ასოს, ანუ W-ს
# #H-1 e-2 l-3 l-4 o-5 _-6 W-7 o-8 r-9 l-10 d-11 !-12
# #სპეისიც ითვლება ამ დროს, რადგან ისიც სიმბოლოა



# #updating elements
# nums = [5, 8, 2]
# nums[1] = 42

# print(nums)
# #მოცემული კოდით nums[1], ანუ 8 შეიცვლება 42-ით.



# #multypling 
# nums=[1,2,3]
# print(nums * 3)
# #გამრავლების დროს უბრალოდ nums დაიწერება 3-ჯერ, რადგან 3-ზე გავამრავლეთ
# #მაგალითი
# x=[2,4]
# x=x * 3
# print(x[3])
# #აქ დაიპრინტება 4, რადგან 3-ზე გამრავლების შემდეგ x იქნება [2,4,2,4,2,4], შესაბამისად აქ მე-3 ადგილზე
# #არის 4 და ამიტომ დაიპრინტება 4.



# #in-შემოწმება
# words=["egg","apple","fries","potato"]
# "egg" in words #---> True, რადგან "egg" არის words-ში
# "apple" in words#---> True, რადგან "apple" არის words-ში
# "tomato" in words#---> False, რადგან "tomato" არ არის words-ში



# #next step
# nums=[10,9,8,7,6,5]
# nums[0]=nums[1]-5 #აქ მე-0 გადაიქცევა 9-5-ად ანუ 4-ად
# if 4 in nums: #შემდეგ თუ 4 არის nums-ში , მაშინ უნდა დაიპრინტოს nums[3],ანუ 7
#     print(nums[3])
# else:         #ყველა დანარჩენ შემთხვევაში, უნდა დაიპრინტოს nums[4],ანუ 6
#     print(nums[4])    



# x="hello world"
# if "world" in x:
#     print:(1)



#not-ები
#not არის სიტყვა, რომელიც ლოგიკას ატრიალებს
# nums=[1,2,3]
# print(not 4 in nums) #---> დაიპრინტება True, რადგან 4 არ არის(not) nums-ში
# print(4 not in nums) #--->არ აქვს მნიშვნელობა ჯერ დავწერთ not-s და მერე 4-ს, თუ პირიქით, პასუხი მაინც იქნება True



# i=0
# while i<10:
#     print(i)

#     i+=1


# i=0
# for i in range(1,20,3):
#     print(i)

# for char in "ნიკოლოზ":
#     print(char)    

# my_list=["nika", "nino", "giorgi", "sandro"]

# for element in my_list:
#     print(element)

#.